L6663/stm32u5-smartwatch/Core/Src/bsp_ili9341_4line.c
/**
  ******************************************************************************
  * @file   bsp_ili9341_4line.c
  * @brief  2.8寸屏ILI9341驱动文件，采用4线SPI
  * 
  ******************************************************************************
  */
#include "bsp_ili9341_4line.h"
#include "stm32u5xx_hal.h"
//
extern SPI_HandleTypeDef hspi1;
extern DMA_HandleTypeDef handle_GPDMA1_Channel0;
//
static uint8_t DFT_SCAN_DIR; //扫描方向 
//管理ILI9341重要参数
static _ILI9341_dev ILI9341dev;
/* ==================== LCD发送性能配置 ==================== */
#define LCD_MAX_WIDTH          320U
#define LCD_TX_LINES           1U
#define LCD_SPI_TIMEOUT_MS     1000U

/*
 * 320像素 × 8行 × 2字节 = 5120字节。
 * SPI保持8位模式，发送前把RGB565转换为ILI9341要求的高字节优先格式。
 */
static uint8_t lcd_tx_buffer[LCD_MAX_WIDTH * LCD_TX_LINES * 2U];

/* 仅用于调试，可在Watch窗口观察。 */
volatile uint32_t g_lcd_flush_count = 0U;
volatile uint32_t g_lcd_flush_error = 0U;
		  
/*
**********************************************************************
* @fun     :ILI9341_WR_REG 
* @brief   :写寄存器函数
* @param   :REG:寄存器值
* @return  :None 
**********************************************************************
*/
inline void ILI9341_WR_REG(uint8_t REG)
{ 
	HAL_GPIO_WritePin(LCD_DCX_GPIO_Port, LCD_DCX_Pin, GPIO_PIN_RESET);
	
	HAL_SPI_Transmit(&hspi1,&REG,1, 1);  //不读取从机返回数据 	
	
	HAL_GPIO_WritePin(LCD_DCX_GPIO_Port, LCD_DCX_Pin, GPIO_PIN_SET);
}
/*
**********************************************************************
* @fun     :ILI9341_WR_DATA 
* @brief   :写ILI9341数据
* @param   :DATA:要写入的值
* @return  :None 
**********************************************************************
*/
inline void ILI9341_WR_DATA(uint8_t DATA)
{										    	   
	HAL_SPI_Transmit(&hspi1,&DATA,1, 1);  //不读取从机返回数据 		
}		
/*
**********************************************************************
* @fun     :ILI9341_WriteReg 
* @brief   :ILI9341_Reg:寄存器地址，ILI9341_RegValue:要写入的数据
* @param   :
* @return  :None 
**********************************************************************
*/
inline void ILI9341_WriteReg(uint8_t ILI9341_Reg, uint8_t ILI9341_RegValue)
{	
	ILI9341_WR_REG(ILI9341_Reg);
	ILI9341_WR_DATA(ILI9341_RegValue);
}	
/*
**********************************************************************
* @fun     :ILI9341_WriteRAM_Prepare 
* @brief   :开始写GRAM
* @param   :
* @return  :None 
**********************************************************************
*/
inline void ILI9341_WriteRAM_Prepare(void)
{
 	ILI9341_WR_REG(ILI9341dev.wramcmd);
}	 
/*
**********************************************************************
* @fun     :ILI9341_WriteRAM 
* @brief   :ILI9341写GRAM，SPI数据写入方式不同，功能同ILI9341_WriteRAM_Prepare
* @param   :
* @return  :None 
**********************************************************************
*/
inline void ILI9341_WriteRAM(uint16_t DAT)
{
    uint8_t TempBufferD[2];

    TempBufferD[0] = (uint8_t)(DAT >> 8);
    TempBufferD[1] = (uint8_t)(DAT & 0xFFU);

    (void)HAL_SPI_Transmit(&hspi1,
                           TempBufferD,
                           2U,
                           LCD_SPI_TIMEOUT_MS);
}
/*
**********************************************************************
* @fun     :ILI9341_SetCursor 
* @brief   :设置光标位置
* @param   :Xpos:横坐标，Ypos:纵坐标
* @return  :None 
**********************************************************************
*/
inline void ILI9341_SetCursor(uint16_t Xpos, uint16_t Ypos)
{	 
	uint8_t TempBufferX[2] = {Xpos >> 8, Xpos & 0XFF};
	uint8_t TempBufferY[2] = {Ypos >> 8, Ypos & 0XFF};
	//
	ILI9341_WR_REG(ILI9341dev.setxcmd); 
	//
	HAL_SPI_Transmit(&hspi1, TempBufferX, 2, 1);			
	//	
	ILI9341_WR_REG(ILI9341dev.setycmd);
	//
	HAL_SPI_Transmit(&hspi1, TempBufferY, 2, 1);		
} 
/*
**********************************************************************
* @fun     :ILI9341_SetArea 
* @brief   :设置显示区域
* @param   :x0/x1:横坐标，y0/y1:纵坐标
* @return  :None 
**********************************************************************
*/
static uint16_t old_x0=0xFFFF, old_x1=0xFFFF, old_y0=0xFFFF, old_y1=0xFFFF;
//
inline void ILI9341_SetArea(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{	 
  uint8_t arguments[4];
  // Set columns, if changed
  if (x0 != old_x0 || x1 != old_x1)
  {
    arguments[0] = x0 >> 8;
    arguments[1] = x0 & 0xFF;
    arguments[2] = x1 >> 8;
    arguments[3] = x1 & 0xFF;
		//
		ILI9341_WR_REG(ILI9341dev.setxcmd); 
		HAL_SPI_Transmit(&hspi1, arguments, 4, 1);
		//
    old_x0 = x0;
    old_x1 = x1;
  }
  // Set rows, if changed
  if (y0 != old_y0 || y1 != old_y1)
  {
    arguments[0] = y0 >> 8;
    arguments[1] = y0 & 0xFF;
    arguments[2] = y1 >> 8;
    arguments[3] = y1 & 0xFF;
		//
		ILI9341_WR_REG(ILI9341dev.setycmd); 
		HAL_SPI_Transmit(&hspi1, arguments, 4, 1);
		//
    old_y0 = y0;
    old_y1 = y1;
  }	
} 
/*
**********************************************************************
* @fun     :ILI9341_Display_Dir 
* @brief   :设置ILI9341的自动扫描方向
							Memory Access Control (36h)
							This command defines read/write scanning direction of the frame memory.

							These 3 bits control the direction from the MPU to memory write/read.

							Bit  Symbol  Name  Description
							D7   MY  Row Address Order
							D6   MX  Column Address Order
							D5   MV  Row/Column Exchange
							D4   ML  Vertical Refresh Order  LCD vertical refresh direction control. 、

							D3   BGR RGB-BGR Order   Color selector switch control
										(0 = RGB color filter panel, 1 = BGR color filter panel )
							D2   MH  Horizontal Refresh ORDER  LCD horizontal refreshing direction control.
							D1   X   Reserved  Reserved
							D0   X   Reserved  Reserved
* @param   :
* @return  :None 
**********************************************************************
*/
void ILI9341_Display_Dir(Screen_ShowDIR ShowDIR)
{
	uint16_t regval=0x08; //RGB-BGR Order不能改变
	uint8_t dirreg=0;
	
	if(ShowDIR == SCAN_Vertical)	//竖屏
	{
		ILI9341dev.width=240;
		ILI9341dev.height=320;
 
		ILI9341dev.wramcmd=0X2C;
		ILI9341dev.setxcmd=0X2A;
		ILI9341dev.setycmd=0X2B;  
    DFT_SCAN_DIR=L2R_U2D;		
		
		switch(DFT_SCAN_DIR)
		{
			case L2R_U2D://从左到右,从上到下  //竖屏
				regval|=(0<<7)|(0<<6)|(0<<5); 
				break;
			case R2L_D2U://从右到左,从下到上   //竖屏
				regval|=(1<<7)|(1<<6)|(0<<5); 
				break;	 
		}
	}else //横屏
	{	  				
		ILI9341dev.width=320;
		ILI9341dev.height=240;
 
		ILI9341dev.wramcmd=0X2C;
		ILI9341dev.setxcmd=0X2A;
		ILI9341dev.setycmd=0X2B;  
		DFT_SCAN_DIR=D2U_L2R;	
		
		switch(DFT_SCAN_DIR)
		{
			case U2D_R2L://从上到下,从右到左  //横屏
				regval|=(0<<7)|(1<<6)|(1<<5); 
				break;
			case D2U_L2R://从下到上,从左到右  //横屏
				regval|=(1<<7)|(0<<6)|(1<<5); 
				break;
		}
	}
	dirreg=0X36; 
  regval|=0x00;	
	ILI9341_WriteReg(dirreg,regval);
	//设置光标在原点位置		
	ILI9341_WR_REG(ILI9341dev.setxcmd); 
	ILI9341_WR_DATA(0);ILI9341_WR_DATA(0);
	ILI9341_WR_DATA((ILI9341dev.width-1)>>8);ILI9341_WR_DATA((ILI9341dev.width-1)&0XFF);
	ILI9341_WR_REG(ILI9341dev.setycmd); 
	ILI9341_WR_DATA(0);ILI9341_WR_DATA(0);
	ILI9341_WR_DATA((ILI9341dev.height-1)>>8);ILI9341_WR_DATA((ILI9341dev.height-1)&0XFF);  	
}
/*
**********************************************************************
* @fun     :ILI9341_Init 
* @brief   :初始化ILI9341
* @param   :
* @return  :None 
**********************************************************************
*/
void ILI9341_Init(void)
{ 
  //ILI9341复位 
	HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_SET);
	HAL_Delay(1);
	HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_RESET);
	HAL_Delay(80);
	HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_SET);
	HAL_Delay(10);
	//************* Start Initial Sequence **********//
	ILI9341_WR_REG(0xCF);  
	ILI9341_WR_DATA(0x00); 
	ILI9341_WR_DATA(0xC1); 
	ILI9341_WR_DATA(0X30); 
	
	ILI9341_WR_REG(0xED);  
	ILI9341_WR_DATA(0x64); 
	ILI9341_WR_DATA(0x03); 
	ILI9341_WR_DATA(0X12); 
	ILI9341_WR_DATA(0X81); 
	
	ILI9341_WR_REG(0xE8);  
	ILI9341_WR_DATA(0x85); 
	ILI9341_WR_DATA(0x10); 
	ILI9341_WR_DATA(0x7A); 
	
	ILI9341_WR_REG(0xCB);  
	ILI9341_WR_DATA(0x39); 
	ILI9341_WR_DATA(0x2C); 
	ILI9341_WR_DATA(0x00); 
	ILI9341_WR_DATA(0x34); 
	ILI9341_WR_DATA(0x02); 
	
	ILI9341_WR_REG(0xF7);  
	ILI9341_WR_DATA(0x20); 
	
	ILI9341_WR_REG(0xEA);  
	ILI9341_WR_DATA(0x00); 
	ILI9341_WR_DATA(0x00); 
	
	ILI9341_WR_REG(0xC0);    //Power control 
	ILI9341_WR_DATA(0x1B);   //VRH[5:0] 
	
	ILI9341_WR_REG(0xC1);    //Power control 
	ILI9341_WR_DATA(0x01);   //SAP[2:0];BT[3:0] 
	
	ILI9341_WR_REG(0xC5);    //VCM control 
	ILI9341_WR_DATA(0x30); 	 //3F
	ILI9341_WR_DATA(0x30); 	 //3C
	
	ILI9341_WR_REG(0xC7);    //VCM control2 
	ILI9341_WR_DATA(0XB7); 
	
	ILI9341_WR_REG(0x36);    // Memory Access Control 
	ILI9341_WR_DATA(0x48);	 //RGB 
	
	ILI9341_WR_REG(0x3A);   
	ILI9341_WR_DATA(0x55); 
	
	ILI9341_WR_REG(0xB1);   
	ILI9341_WR_DATA(0x00);   
	ILI9341_WR_DATA(0x10);   //Frame Rate 119(Hz)
	
	ILI9341_WR_REG(0xB6);    // Display Function Control 
	ILI9341_WR_DATA(0x0A); 
	ILI9341_WR_DATA(0xA2); 
	
	ILI9341_WR_REG(0xF2);    // 3Gamma Function Disable 
	ILI9341_WR_DATA(0x00); 
	
	ILI9341_WR_REG(0x26);    //Gamma curve selected 
	ILI9341_WR_DATA(0x01); 
	
	ILI9341_WR_REG(0xE0);    //Set Gamma 
	ILI9341_WR_DATA(0x0F); 
	ILI9341_WR_DATA(0x2A); 
	ILI9341_WR_DATA(0x28); 
	ILI9341_WR_DATA(0x08); 
	ILI9341_WR_DATA(0x0E); 
	ILI9341_WR_DATA(0x08); 
	ILI9341_WR_DATA(0x54); 
	ILI9341_WR_DATA(0XA9); 
	ILI9341_WR_DATA(0x43); 
	ILI9341_WR_DATA(0x0A); 
	ILI9341_WR_DATA(0x0F); 
	ILI9341_WR_DATA(0x00); 
	ILI9341_WR_DATA(0x00); 
	ILI9341_WR_DATA(0x00); 
	ILI9341_WR_DATA(0x00); 
	
	ILI9341_WR_REG(0XE1);    //Set Gamma 
	ILI9341_WR_DATA(0x00); 
	ILI9341_WR_DATA(0x15); 
	ILI9341_WR_DATA(0x17); 
	ILI9341_WR_DATA(0x07); 
	ILI9341_WR_DATA(0x11); 
	ILI9341_WR_DATA(0x06); 
	ILI9341_WR_DATA(0x2B); 
	ILI9341_WR_DATA(0x56); 
	ILI9341_WR_DATA(0x3C); 
	ILI9341_WR_DATA(0x05); 
	ILI9341_WR_DATA(0x10); 
	ILI9341_WR_DATA(0x0F); 
	ILI9341_WR_DATA(0x3F); 
	ILI9341_WR_DATA(0x3F); 
	ILI9341_WR_DATA(0x0F); 
	
	ILI9341_WR_REG(0x2B); 
	ILI9341_WR_DATA(0x00);
	ILI9341_WR_DATA(0x00);
	ILI9341_WR_DATA(0x01);
	ILI9341_WR_DATA(0x3f);
	
	ILI9341_WR_REG(0x2A); 
	ILI9341_WR_DATA(0x00);
	ILI9341_WR_DATA(0x00);
	ILI9341_WR_DATA(0x00);
	ILI9341_WR_DATA(0xef);	
	
	ILI9341_WR_REG(0x35);	//Tearing Effect Line ON  
	ILI9341_WR_DATA(0x00);
	
	ILI9341_WR_REG(0x11);	//Sleep Out
	HAL_Delay(120);
	ILI9341_WR_REG(0x21);	//Display Inversion ON
	ILI9341_WR_REG(0x29);	//Display ON
	HAL_Delay(20);
	ILI9341_Display_Dir(SCAN_Horizontal);	//横屏显示
	//批量清屏，避免逐像素调用HAL
	ILI9341_Clear(BLACK);
}  
/*
**********************************************************************
* @fun     :ILI9341_Clear 
* @brief   :清屏函数，color:要清屏的填充色
* @param   :
* @return  :None 
**********************************************************************
*/
void ILI9341_Clear(uint16_t color)
{
    uint32_t totalPixels;
    uint32_t pixelsRemaining;
    uint32_t bufferPixels;
    uint32_t index;
    uint16_t transferPixels;
    uint8_t highByte;
    uint8_t lowByte;

    highByte = (uint8_t)(color >> 8);
    lowByte  = (uint8_t)(color & 0xFFU);

    bufferPixels = LCD_MAX_WIDTH * LCD_TX_LINES;

    for (index = 0U; index < bufferPixels; index++)
    {
        lcd_tx_buffer[index * 2U]      = highByte;
        lcd_tx_buffer[index * 2U + 1U] = lowByte;
    }

    ILI9341_SetArea(0U,
                    0U,
                    (uint16_t)(ILI9341dev.width - 1U),
                    (uint16_t)(ILI9341dev.height - 1U));
    ILI9341_WriteRAM_Prepare();

    totalPixels = (uint32_t)ILI9341dev.width *
                  (uint32_t)ILI9341dev.height;
    pixelsRemaining = totalPixels;

    while (pixelsRemaining > 0U)
    {
        transferPixels = (pixelsRemaining > bufferPixels)
                       ? (uint16_t)bufferPixels
                       : (uint16_t)pixelsRemaining;

        if (HAL_SPI_Transmit(&hspi1,
                             lcd_tx_buffer,
                             (uint16_t)(transferPixels * 2U),
                             LCD_SPI_TIMEOUT_MS) != HAL_OK)
        {
            g_lcd_flush_error = 3U;
            return;
        }

        pixelsRemaining -= transferPixels;
    }
}
/*
**********************************************************************
* @fun     :_HW_DrawPoint 
* @brief   :uGUI函数调用，画点函数
* @param   :x,y:坐标，color:此点的颜色
* @return  :None 
**********************************************************************
*/
void _HW_DrawPoint(uint16_t x,uint16_t y,uint16_t color)
{	
	uint8_t TempBufferX[2] = {x >>8, x & 0XFF};
	uint8_t TempBufferY[2] = {y >>8, y & 0XFF};
	uint8_t TempBufferD[2] = {color >> 8, color};
	//
	ILI9341_WR_REG(ILI9341dev.setxcmd); 
	//
	HAL_SPI_Transmit(&hspi1, TempBufferX, 2, 1);		
	//
	ILI9341_WR_REG(ILI9341dev.setycmd); 
	//
	HAL_SPI_Transmit(&hspi1, TempBufferY, 2, 1);		
	//
	ILI9341_WR_REG(ILI9341dev.wramcmd); 
	//
	HAL_SPI_Transmit(&hspi1, TempBufferD, 2, 1);		
}	
/*
**********************************************************************
* @fun     :_HW_FillFrame 
* @brief   :在指定区域内填充单个颜色
* @param   :(sx,sy),(ex,ey):填充矩形对角坐标,区域大小为:(ex-sx+1)*(ey-sy+1),color:要填充的颜色
* @return  :None 
**********************************************************************
*/
void _HW_FillFrame(uint16_t sx,
                   uint16_t sy,
                   uint16_t ex,
                   uint16_t ey,
                   uint16_t *color)
{
    uint16_t width;
    uint16_t height;
    uint16_t rowsRemaining;
    uint16_t rowsThisTransfer;
    uint32_t pixelCount;
    uint32_t index;
    uint16_t pixel;
    uint16_t *source;
    HAL_StatusTypeDef status;

    g_lcd_flush_error = 0U;

    if ((color == NULL) ||
        (ex < sx) ||
        (ey < sy))
    {
        g_lcd_flush_error = 1U;
        return;
    }

    width  = (uint16_t)(ex - sx + 1U);
    height = (uint16_t)(ey - sy + 1U);

    if ((width == 0U) ||
        (height == 0U) ||
        (width > LCD_MAX_WIDTH))
    {
        g_lcd_flush_error = 1U;
        return;
    }

    /*
     * SPI始终保持8位模式。
     * 不在运行时修改DataSize，不使用DMA，避免此前黑屏问题。
     */
    ILI9341_SetArea(sx, sy, ex, ey);
    ILI9341_WriteRAM_Prepare();

    source = color;
    rowsRemaining = height;

    while (rowsRemaining > 0U)
    {
        rowsThisTransfer = (rowsRemaining > LCD_TX_LINES)
                         ? LCD_TX_LINES
                         : rowsRemaining;

        pixelCount = (uint32_t)width *
                     (uint32_t)rowsThisTransfer;

        /*
         * STM32内存中的uint16_t为小端；
         * ILI9341串行RGB565要求高字节先发送。
         */
        for (index = 0U; index < pixelCount; index++)
        {
            pixel = source[index];

            lcd_tx_buffer[index * 2U] =
                (uint8_t)(pixel >> 8);

            lcd_tx_buffer[index * 2U + 1U] =
                (uint8_t)(pixel & 0xFFU);
        }

        status = HAL_SPI_Transmit(&hspi1,
                                  lcd_tx_buffer,
                                  (uint16_t)(pixelCount * 2U),
                                  LCD_SPI_TIMEOUT_MS);

        if (status != HAL_OK)
        {
            g_lcd_flush_error = 2U;
            return;
        }

        source += pixelCount;
        rowsRemaining =
            (uint16_t)(rowsRemaining - rowsThisTransfer);
    }

    g_lcd_flush_count++;
}
/*
**********************************************************************
* @fun     :_HW_DrawLine 
* @brief   :画线
* @param   :_usX1,_usY1:起点坐标,_usX2,_usY2:终点坐标,_usColor:要填充的颜色
* @return  :None 
**********************************************************************
*/
void _HW_DrawLine(uint16_t _usX1,uint16_t _usY1,uint16_t _usX2,uint16_t _usY2,uint16_t _usColor)
{
	int32_t dx,dy;
	int32_t tx ,ty;
	int32_t inc1,inc2;
	int32_t d,iTag;
	int32_t x,y;
	/* 采用 Bresenham 算法，在2点间画一条直线 */
	_HW_DrawPoint(_usX1,_usY1,_usColor);
	/* 如果两点重合，结束后面的动作。*/
	if (_usX1==_usX2 && _usY1==_usY2) {return;}

	iTag =0;
	/* dx = abs ( _usX2 - _usX1 ); */
	if (_usX2 >=_usX1) {dx=_usX2-_usX1;}
	else {dx =_usX1-_usX2;}

	/* dy =abs (_usY2-_usY1); */
	if (_usY2 >=_usY1) {dy = _usY2-_usY1;}
	else {dy = _usY1-_usY2;}

	if (dx < dy)   /*如果dy为计长方向，则交换纵横坐标。*/
	{
		uint16_t temp;
		iTag = 1;
		temp = _usX1; _usX1 = _usY1; _usY1 = temp;
		temp = _usX2; _usX2 = _usY2; _usY2 = temp;
		temp = dx; dx = dy; dy = temp;
	}
	
	tx = _usX2 > _usX1 ? 1 : -1;    /* 确定是增1还是减1 */
	ty = _usY2 > _usY1 ? 1 : -1;
	x = _usX1;
	y = _usY1;
	inc1 = 2 * dy;
	inc2 = 2 * (dy - dx);
	d = inc1 - dx;
	while (x != _usX2)     /* 循环画点 */
	{
		if (d < 0) {d += inc1;}
		else {y += ty ; d += inc2 ;}
		
		if (iTag) { _HW_DrawPoint(y,x,_usColor);}
		else {_HW_DrawPoint(x,y,_usColor);}
		
		x += tx ;
	}	
}   
/*
**********************************************************************
* @fun     :LCD_DrawRect 
* @brief   :绘制水平放置的矩形
* @param   :
*			_usX,_usY: 矩形左上角的坐标
*			_usHeight : 矩形的高度
*			_usWidth  : 矩形的宽度
* @return  :None 
**********************************************************************
*/
void LCD_DrawRect(uint16_t _usX, uint16_t _usY, uint16_t _usHeight, uint16_t _usWidth, uint16_t _usColor)
{	
	_HW_DrawLine(_usX, _usY, _usX + _usWidth - 1, _usY, _usColor);	/* 顶 */
	_HW_DrawLine(_usX, _usY + _usHeight - 1, _usX + _usWidth - 1, _usY + _usHeight - 1, _usColor);	/* 底 */

	_HW_DrawLine(_usX, _usY, _usX, _usY + _usHeight - 1, _usColor);	/* 左 */
	_HW_DrawLine(_usX + _usWidth - 1, _usY, _usX + _usWidth - 1, _usY + _usHeight, _usColor);	/* 右 */	
}
/*
**********************************************************************
* @fun     :LCD_DrawCircle 
* @brief   :绘制一个圆，笔宽为1个像素
* @param   :
*			_usX,_usY  : 圆心的坐标
*			_usRadius  : 圆的半径
* @return  :None 
**********************************************************************
*/
void LCD_DrawCircle(uint16_t _usX, uint16_t _usY, uint16_t _usRadius, uint16_t _usColor)
{
	int32_t  D;			/* Decision Variable */
	uint32_t  CurX;		/* 当前 X 值 */
	uint32_t  CurY;		/* 当前 Y 值 */

	D = 3 - (_usRadius << 1);
	CurX = 0;
	CurY = _usRadius;

	while (CurX <= CurY)
	{
		_HW_DrawPoint(_usX + CurX, _usY + CurY, _usColor);
		_HW_DrawPoint(_usX + CurX, _usY - CurY, _usColor);
		_HW_DrawPoint(_usX - CurX, _usY + CurY, _usColor);
		_HW_DrawPoint(_usX - CurX, _usY - CurY, _usColor);
		_HW_DrawPoint(_usX + CurY, _usY + CurX, _usColor);
		_HW_DrawPoint(_usX + CurY, _usY - CurX, _usColor);
		_HW_DrawPoint(_usX - CurY, _usY + CurX, _usColor);
		_HW_DrawPoint(_usX - CurY, _usY - CurX, _usColor);

		if (D < 0)
		{
			D += (CurX << 2) + 6;
		}
		else
		{
			D += ((CurX - CurY) << 2) + 10;
			CurY--;
		}
		CurX++;
	}
}

